[
  {
    "project": "svelte-todo",
    "projectName": "Svelte Full-stack Todo App",
    "briefDescription": "A simple todo app that stores tasks in a backend database",
    "keywords": "Full-stack, Svelte, Pico.css, Axios, MongoDB, Mongoose",
    "projectDescription":
      "This CRUD app was built using Svelte, initially following a simple front-end Svelte tutorial before expansion into a full-stack application. The user enters a task in the input section, with a limit of 40 characters to aid in a uniform design, especially for mobile responsiveness. On pressing the add button, the task is sent to the back end MongoDB where it is stored until the task is deleted, and the task is rendered on the app instantly (at least according to connection times to the database) using Svelte./n/nFrom there, more tasks can be added and existing ones can be edited. Two checkboxes allow for the marking of completed tasks and important tasks. On checking the boxes, the lists are updated in real-time with the completed column rendering completed tasks, and important tasks being sorted to the top of their respective lists with a different styling to highlight them. Deletion of items is instantaneous.",
    "projectLimitations": 
      "Only one list exists across all instances, meaning that anyone using the app will be accessing the same list as everyone else. Any changes someone make to the list is present to all users. This is more to do with the fact the project is designed to showcase CRUD actions and real-time rendering.",
    "projectLinks": {
      "deployed": "https://ashley-svelte-todo.netlify.app/",
      "github": "https://github.com/AshlavaDev/sveltekit-todo-app"
    },
    "images": [
      {
        "name": "main-image",
        "src": "/images/project_images/svelte_todo/svelte-app-desktop-populated.png",
        "alt": "A todo app with 4 items present"
      },
      {
        "name": "second-image",
        "src": "/images/project_images/svelte_todo/svelte-app-desktop-empty.png",
        "alt": "A todo app with no items present"
      },
      {
        "name": "third-image",
        "src": "/images/project_images/svelte_todo/svelte-app-mobile.png",
        "alt": "A todo app with 4 items present on mobile screen"
      }
    ]
  },
  {
    "project": "kyber-corp",
    "projectName": "Kyber Corporation",
    "briefDescription": "A fairly simple website for a fake company with a cyberpunk theme",
    "keywords": "Front-end, Next 13, Framer Motion, TailwindCSS, Typescript",
    "projectDescription":
      "This static site was built using Next 13, TailwindCSS, and Typescript (ie Next 13 and the options it gives me) with a few small libraries added. The idea originally came while I was working on a design assignment during a web design class as part of my certification, and after more than a year of it sitting in a Figma file I opened it up and made what was in the file (with a few changes) and fleshed it out into a full site. The concept stems from my love of cyberpunk things, which greatly informs the aesthetic and content, even though it is from a corporate perspective given they are usually the antagonists of the genre. The features show though are meant to be reflective of what a small business website would contain even if the design is a little different.",
    "projectLimitations": "The biggest limitations is that the form is not how a regular form would work, and images and content is local to the site files. The form was purposely not set up so that anyone viewing the site would not spam me (or themselves or whoever owns the email that was inputted into the form). As for local storage, this was mostly due to an abundance of caution on my part with using resources for thigns that won't change while the project exists.",
    "projectLinks": {
      "deployed": "https://kyber-corps.netlify.app",
      "github": "https://github.com/AshlavaDev/kyber-corp"
    },
    "images": [
      {
        "name": "main-image",
        "src": "/images/project_images/kyber_corp/desktop_home.png",
        "alt": "The desktop homepage of Kyber Corp"
      },
      {
        "name": "second-image",
        "src": "/images/project_images/kyber_corp/mobile_home.png",
        "alt": "The mobile homepage of Kyber Corp"
      },
      {
        "name": "third-image",
        "src": "/images/project_images/kyber_corp/desktop_contact.png",
        "alt": "Part of the desktop contact page with form"
      },
      {
        "name": "fourth-image",
        "src": "/images/project_images/kyber_corp/desktop_service_modal.png",
        "alt": "Desktop services page with information modal open"
      }
    ]
  },
  {
    "project": "next-blogging",
    "projectName": "Next Blogging",
    "briefDescription": "A blog site built using Next 13",
    "keywords": "Full-stack, Next 13, TailwindCSS, Axios, Prisma, MongoDB, Typescript, React Hot Toast, Next Authentication, Cloudinary, Bcrypt",
    "projectDescription": 
      "This full-stack project uses CRUD to process blog posts. A user can create a post, see their own posts and posts of others, update their own posts, and delete their own posts. Furhtermore, they can update their own profile information. It uses Next Authentication for sign up and login, and the site renders differently depending on whether they are signed in or not.It is fully mobile responsive in design and features both a light scheme and a dark scheme depending on browser settings. The schemes are effectively reverses of each other and with the exception of some red elements for links and danger warnings, are on the same gray scale of the default gray of Tailwindcss. Font is imported with Next's Google font imports.",
    "projectLimitations": 
      "There are 3 limitations, which are things I would like to add. The first is that the content section of a blog renders all as one block even though the textarea input allows for new lines. The second is that there is no search functionality which would be useful. The last is that there is no toggle between dark and light mode, rather it relies on the system or browser.",
    "projectLinks": {
      "deployed": "https://next-blogging-portfolio.vercel.app/",
      "github": "https://github.com/AshlavaDev/next-blog"
    },
    "images": [
      {
        "name": "main-image",
        "src": "/images/project_images/next_blog/desktop-light-homepage.png",
        "alt": "The light mode dektop version of the home page of a blogging site"
      },
      {
        "name": "second-image",
        "src": "/images/project_images/next_blog/desktop-dark-homepage.png",
        "alt": "The dark mode dektop version of the home page of a blogging site"
      },
      {
        "name": "third-image",
        "src": "/images/project_images/next_blog/mobile-dark-login.png",
        "alt": "The dark mode mobile version of a login page"
      },
      {
        "name": "fourth-image",
        "src": "/images/project_images/next_blog/desktop-light-profile.png",
        "alt": "The light mode desktop version of a blog site profile page"
      },
      {
        "name": "fifth-image",
        "src": "/images/project_images/next_blog/desktop-dark-create.png",
        "alt": "The dark mode desktop version of a blog site create post page"
      },
      {
        "name": "sixth-image",
        "src": "/images/project_images/next_blog/mobile-dark-updateblog.png",
        "alt": "The dark mode mobile version of a blog site update post function"
      }
    ]

  }
]